app/controllers/account_controller.rb

SELECT "accounts".* FROM "accounts"  ORDER BY "accounts"."email" ASC
---
	def list
		@user = Account.order(:email)

DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 2]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT 1  [["id", nil]]
---
	def destroy
		@user = Account.find(params[:id]).destroy

INSERT INTO "accounts" ("username", "email", "salt", "hash_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = Account.new(user_params)
		if @user.save