app/controllers/photo_controller.rb

	def index

		@photo = Photo.find.order(:id)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", nil]]

	def save
		@photo = Photo.new(photo_params)
		if @photo.save
---
INSERT INTO "photos" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-06-10 15:22:21.998524"], ["updated_at", "2016-06-10 15:22:21.998524"]]

	def photo
		@photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 8]]

	def photo_large
		@photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 8]]

	def photo_thumbnail
		@photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 8]]