app/controllers/photo_controller.rb

	def index
		@photo = Photo.all
---
SELECT "photos".* FROM "photos"